openbuttnakedgang/l4r9-octo/cube_mx/cube_mx.ioc
PF12.Locked=true
Mcu.Pin110=PA7
Mcu.Pin111=PF11
PA9.Locked=true
Mcu.Pin127=VP_SYS_VS_Systick
PI0.Locked=true
PE7.Locked=true
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=120000000
SH.FMC_NBL1.ConfNb=1
ProjectManager.UnderRoot=false
PE13.Locked=true
PH14.GPIO_Label=DSI_SPI_USART_CS
SH.FMC_D7_DA7.ConfNb=1
Mcu.Pin123=PB10
Mcu.Pin124=PH8
PA4.Signal=DCMI_HSYNC
Mcu.Pin125=PB12
Mcu.Pin126=PB13
PB5.Signal=SAI1_SD_B
PG15.GPIOParameters=GPIO_Label
Mcu.Pin120=PB2
Mcu.Pin121=PF12
PE13.GPIO_Label=D10
Mcu.Pin122=PE11
PD11.Signal=FMC_A16_CLE
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
SH.FMC_A5.0=FMC_A5,21b-a1
PA11.Signal=USB_OTG_FS_DM
PH5.Locked=true
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
SH.ADCx_IN5.0=ADC1_IN5
Mcu.Pin109=PA3
PE2.Locked=true
PC3.GPIO_Label=ARD_A2
PF3.Locked=true
Mcu.Pin105=PB15
Mcu.Pin106=DSIHOST_D0P
Mcu.Pin107=DSIHOST_D0N
Mcu.Pin108=PA1
PB4\ (NJTRST).GPIO_Label=ARD_D6
PE12.GPIOParameters=GPIO_Label
PG3.GPIO_Label=PSRAM_A13
SH.FMC_D12_DA12.ConfNb=1
RCC.I2C2Freq_Value=120000000
PD1.Locked=true
PB0.Signal=ADCx_IN15
PA7.GPIOParameters=GPIO_Label
PC0.Locked=true
PC1.Signal=LPUART1_TX
PB12.GPIOParameters=GPIO_Label
PD2.GPIO_Label=uSD_CMD
PG10.GPIO_Label=OCTOSPIM_P2_IO7
PH2.GPIO_Label=MIC_VDD
PD7.GPIOParameters=GPIO_Label
PG7.GPIOParameters=GPIO_Label
Mcu.Pin101=PF14
PA13\ (JTMS/SWDIO).Signal=SYS_JTMS-SWDIO
Mcu.Pin102=PE7
Mcu.Pin103=PE13
Mcu.Pin104=PH5
Mcu.Pin100=PA6
SH.GPXTI1.0=GPIO_EXTI1
RCC.SAI1Freq_Value=32000000
SH.S_DATAIN3DFSDM1.ConfNb=1
RCC.CortexFreq_Value=120000000
SH.FMC_A2.ConfNb=1
PH14.Locked=true
PI10.GPIOParameters=GPIO_Label
Mcu.UserName=STM32L4R9AIIx
PD9.GPIOParameters=GPIO_Label
DSIHOST_D1P.GPIOParameters=GPIO_Label
PH0-OSC_IN\ (PH0).Locked=true
PC10.Locked=true
PC10.Signal=SDMMC1_D2
SH.FMC_NBL0.0=FMC_NBL0,2ByteEnable1
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_FMC_Init-FMC-false-HAL-true,4-MX_I2C1_Init-I2C1-false-HAL-true,5-MX_SAI1_Init-SAI1-false-HAL-true,6-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,7-MX_SPI2_Init-SPI2-false-HAL-true,8-MX_USART2_UART_Init-USART2-false-HAL-true,9-MX_USART3_UART_Init-USART3-false-HAL-true,10-MX_USB_OTG_FS_PCD_Init-USB_OTG_FS-false-HAL-true
PC0.GPIOParameters=GPIO_Label
SH.S_TIM5_CH2.0=TIM5_CH2
PC0.GPIO_Label=ARD_D0
SH.FMC_D6_DA6.0=FMC_D6,16b-d1
PC9.Locked=true
PB0.GPIO_Label=ARD_A3
RCC.USART2Freq_Value=120000000
PI5.GPIO_Label=DCMI_VSYNC
PH5.GPIO_Label=DCMI_PIXCLK
PC13.GPIO_Label=JOY_SEL
PB11.Signal=USART3_RX
PI0.GPIOParameters=GPIO_Label
PE5.GPIOParameters=GPIO_Label
ProjectManager.StackSize=0x400
PI11.GPIOParameters=GPIO_Label
RCC.VCOInput3Freq_Value=4000000
RCC.I2C3Freq_Value=120000000
PA12.Locked=true
SH.FMC_A7.0=FMC_A7,21b-a1
PA12.Signal=USB_OTG_FS_DP
PH4.GPIOParameters=GPIO_Label
Mcu.UserConstants=
RCC.VCOSAI1OutputFreq_Value=64000000
PI1.GPIOParameters=GPIO_Label
PC1.GPIOParameters=GPIO_Label
PF5.Locked=true
Mcu.ThirdPartyNb=0
PD11.GPIO_Label=PSRAM_A16
RCC.HCLKFreq_Value=120000000
Mcu.IPNb=11
PF11.GPIO_Label=DSI_TE
PD8.GPIOParameters=GPIO_Label
PF12.Signal=FMC_A6
Mcu.Pin6=PA14 (JTCK/SWCLK)
Mcu.Pin7=PA13 (JTMS/SWDIO)
Mcu.Pin8=PI0
Mcu.Pin9=PH14
SH.FMC_A10.0=FMC_A10,21b-a1
RCC.AHBFreq_Value=120000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
Mcu.Pin0=PI10
Mcu.Pin1=PH2
Mcu.Pin2=PE0
Mcu.Pin3=PB4 (NJTRST)
Mcu.Pin4=PB3 (JTDO/TRACESWO)
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PA15 (JTDI)
SH.FMC_D8_DA8.0=FMC_D8,16b-d1
USART2.VirtualMode-Asynchronous=VM_ASYNC
SH.FMC_D2_DA2.0=FMC_D2,16b-d1
PE13.Signal=FMC_D10_DA10
PI5.Locked=true
PI5.Signal=DCMI_VSYNC
PI0.Signal=SPI2_NSS
File.Version=6
PA10.GPIO_Label=USB_OTGFS_ID
SH.ADCx_IN13.ConfNb=1
SH.FMC_D5_DA5.ConfNb=1
SH.FMC_D2_DA2.ConfNb=1
SH.S_TIM2_CH1.ConfNb=1
PG13.Mode=I2C
PE4.Signal=FMC_A20
PE6.GPIOParameters=GPIO_Label
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=cube_mx
PD7.GPIO_Label=PSRAM_NE1
DSIHOST_D1N.GPIOParameters=GPIO_Label
PA7.Locked=true
SH.FMC_D0_DA0.0=FMC_D0,16b-d1
PD14.Locked=true
PA2.GPIO_Label=USART2_TX
RCC.LSI_VALUE=32000
PF5.GPIO_Label=PSRAM_A5
USB_OTG_FS.VirtualMode=Device_Only
SH.FMC_A9.0=FMC_A9,21b-a1
SH.FMC_D4_DA4.0=FMC_D4,16b-d1
DSIHOST_D0N.Locked=true
PE0.GPIO_Label=PSRAM_NBL0
PF5.Signal=FMC_A5
SH.FMC_NL.0=FMC_NL,AddressValid1
PC4.Locked=true
SPI2.Direction=SPI_DIRECTION_2LINES
PF0.Signal=FMC_A0
SH.FMC_NBL0.ConfNb=1
SH.FMC_A14.ConfNb=1
PC2.GPIO_Label=DF_CKOUT
RCC.PLLSAI1N=16
PH14.GPIOParameters=GPIO_Label
SH.FMC_A12.0=FMC_A12,21b-a1
PA2.Locked=true
PE8.GPIOParameters=GPIO_Label
SH.FMC_A9.ConfNb=1
PA13\ (JTMS/SWDIO).Mode=Serial_Wire
PB9.GPIO_Label=SAI1_FSA
PC10.GPIO_Label=uSD_D2
PH11.Signal=DCMI_D2
ProjectManager.NoMain=false
PG3.Signal=FMC_A13
PG1.Signal=FMC_A11
PG1.Locked=true
PC4.Signal=ADCx_IN13
PC15-OSC32_OUT\ (PC15).Signal=RCC_OSC32_OUT
PD5.Signal=FMC_NWE
PI10.Signal=OCTOSPIM_P2_IO1
SH.FMC_A19.ConfNb=1
RCC.VCOSAI2OutputFreq_Value=32000000
PE9.GPIOParameters=GPIO_Label
PD12.Locked=true
RCC.DSITXEscFreq_Value=16000000
PH13.GPIO_Label=ARD_D9
PC8.GPIO_Label=uSD_D0
PC12.GPIOParameters=GPIO_Label
PH8.GPIO_Label=OCTOSPI_P2_IO3
PB4\ (NJTRST).GPIOParameters=GPIO_Label
SH.ADCx_IN12.0=ADC1_IN12
PE15.GPIO_Label=D12
PH4.Signal=GPIO_Output
PB3\ (JTDO/TRACESWO).Locked=true
PD12.GPIOParameters=GPIO_Label
PB3\ (JTDO/TRACESWO).Signal=SYS_JTDO-SWO
ProjectManager.TargetToolchain=Makefile
PE7.GPIOParameters=GPIO_Label
SH.FMC_D1_DA1.ConfNb=1
PF15.Locked=true
PB2.GPIOParameters=GPIO_Label
PE4.Locked=true
PF2.Signal=FMC_A2
PC2.Locked=true
ProjectManager.RegisterCallBack=
PC15-OSC32_OUT\ (PC15).Locked=true
PF5.GPIOParameters=GPIO_Label
PH2.GPIOParameters=GPIO_Label
PH11.Locked=true
DSIHOST_D0P.GPIOParameters=GPIO_Label
PE11.Signal=FMC_D8_DA8
PD3.Locked=true
PG9.GPIO_Label=OCTOSPIM_P2_IO6
SH.FMC_A14.0=FMC_A14,21b-a1
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,Synchro-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock
PG1.GPIO_Label=PSRAM_A11
PD11.GPIOParameters=GPIO_Label
RCC.APB2Freq_Value=120000000
PG4.GPIOParameters=GPIO_Label
SH.FMC_D13_DA13.ConfNb=1
PD4.GPIO_Label=PSRAM_OE
PC13.GPIOParameters=GPIO_Label
SH.S_CKOUTDFSDM1.0=DFSDM1_CKOUT
PI7.GPIO_Label=DCMI_D7
SH.ADCx_IN15.ConfNb=1
PF15.Signal=FMC_A9
PD14.GPIO_Label=D0
PA4.GPIOParameters=GPIO_Label
PF0.Locked=true
PE6.Signal=SAI1_SD_A
PB15.GPIOParameters=GPIO_Label
PE11.Locked=true
Mcu.Name=STM32L4R9A(G-I)Ix
DSIHOST_D0N.GPIO_Label=DSI_D0_N
PA2.Signal=USART2_TX
PD14.Signal=FMC_D0_DA0
PA7.GPIO_Label=ARD_A0
PA12.Mode=Device_Only
PG12.Locked=true
DSIHOST_D0N.Signal=DSIHOST_D0N
PG12.GPIO_Label=OCTOSPIM_P2_CS
PH2.Locked=true
PE3.GPIO_Label=PSRAM_A19
PC9.Signal=SDMMC1_D1
PA15\ (JTDI).Locked=true
RCC.VCOInput2Freq_Value=4000000
RCC.APB1Freq_Value=120000000
PB11.Locked=true
ProjectManager.DeviceId=STM32L4R9AIIx
ProjectManager.LibraryCopy=0
PA7.Signal=ADCx_IN12
PF2.GPIO_Label=PSRAM_A2
